# .zsh_plugins.txt

mattmc3/zephyr path:plugins/zfunctions

# comments are supported like this
ajeetdsouza/zoxide

# or lighter-weight ones like zsh-utils
mattmc3/zephyr path:plugins/clipboard
mattmc3/zephyr path:plugins/environment
mattmc3/zephyr path:plugins/history
mattmc3/zephyr path:plugins/homebrew
mattmc3/zephyr path:plugins/macos
mattmc3/zephyr path:plugins/prompt
mattmc3/zephyr path:plugins/terminal
mattmc3/zephyr path:plugins/utility

# prompts:
#   with prompt plugins, remember to add this to your .zshrc:
#   `autoload -Uz promptinit && promptinit && prompt pure`
romkatv/powerlevel10k 

zsh-users/zsh-completions
mattmc3/zephyr path:plugins/completion

# popular fish-like plugins
jeffreytse/zsh-vi-mode
mattmc3/zman
unixorn/fzf-zsh-plugin
wfxr/forgit
bigH/git-fuzzy path:bin kind:path
Aloxaf/fzf-tab
zsh-users/zsh-autosuggestions 
zdharma-continuum/fast-syntax-highlighting

