birdhackor/zsh-exa-ls-plugin
greymd/tmux-xpanes
hlissner/zsh-autopair
unixorn/fzf-zsh-plugin
wfxr/forgit
smeagol74/zsh-fzf-pass
redxtech/zsh-fzf-utils
mattmc3/zman
ChrisPenner/session-sauce

belak/zsh-utils path:history
belak/zsh-utils path:utility
#belak/zsh-utils path:completion

### Completions
#
# You may want to add some additional completions to Zsh. Completions look in your fpath
# for completion functions (eg: functions named with a leading underscore). You need to
# add any supplemental completions to your fpath prior to running `compinit`. In the
# Frameworks section below, we'll handle compinit, or you could chose to run it
# yourself in your `.zshrc`:
#
#   autoload -Uz compinit && compinit
#
# This is a popular plugin for adding supplemental completions. We combine the `path:`
# and `kind:fpath` annotations here:
#
###
zsh-users/zsh-completions path:src kind:fpath
belak/zsh-utils path:completion
b0o/zfzf


kalsowerus/zsh-bitwarden
joshskidmore/zsh-fzf-history-search 
Aloxaf/fzf-tab kind:defer
Freed-Wu/fzf-tab-source kind:defer

zdharma-continuum/fast-syntax-highlighting kind:defer


zsh-users/zsh-autosuggestions kind:defer

