tap "asmvik/formulae"
tap "felixkratz/formulae"
tap "homebrew/services"
brew "autoconf"
brew "bat"
brew "gettext"
brew "coreutils"
brew "zstd"
brew "dua-cli"
brew "eza"
brew "fzf"
brew "git"
brew "gnupg"
brew "harper"
brew "hugo"
brew "jq"
brew "latexindent"
brew "lazygit"
brew "libass"
brew "ltex-ls-plus"
brew "lua"
brew "mas"
brew "yt-dlp"
brew "mpv"
brew "neovim"
brew "node"
brew "nowplaying-cli"
brew "pandoc"
brew "pass"
brew "pinentry-mac"
brew "pkgconf"
brew "poppler"
brew "pyenv"
brew "rclone"
brew "restic"
brew "ripgrep-all"
brew "starship"
brew "stow"
brew "switchaudio-osx"
brew "tmux"
brew "uv"
brew "yazi"
brew "zsh"
brew "asmvik/formulae/skhd"
brew "asmvik/formulae/yabai"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
cask "brave-browser"
cask "element"
cask "flameshot"
cask "font-ibm-plex-sans"
cask "font-ibm-plex-serif"
cask "font-iosevka"
cask "font-lato"
cask "font-twitter-color-emoji"
cask "ghostty"
cask "hammerspoon"
cask "jellyfin-media-player"
cask "mactex-no-gui"
cask "omnissa-horizon-client"
cask "qbittorrent"
cask "raycast"
cask "skim"
cask "syncthing-app"
cask "tidal"
cask "transmission"
cask "wezterm"
cask "zotero"
mas "Bitwarden", id: 1352778147
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "RMS_sharing", id: 908570259
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
