tap "asmvik/formulae"
tap "felixkratz/formulae"
tap "homebrew-zathura/zathura"
tap "homebrew/services"
tap "morantron/tmux-fingers"
tap "nikitabobko/tap"
brew "gettext"
brew "zstd"
brew "pango"
brew "autoconf"
brew "bat"
brew "coreutils"
brew "pkgconf"
brew "dua-cli"
brew "eza"
brew "fd"
brew "fzf"
brew "git"
brew "gnupg"
brew "harper"
brew "hugo"
brew "jq"
brew "latexindent"
brew "lazygit"
brew "libass"
brew "ltex-ls-plus"
brew "lua"
brew "mas"
brew "yt-dlp"
brew "mpv"
brew "neovim"
brew "node"
brew "nowplaying-cli"
brew "pandoc"
brew "pass"
brew "pinentry-mac"
brew "poppler"
brew "pyenv"
brew "rclone"
brew "restic"
brew "ripgrep"
brew "ripgrep-all"
brew "starship"
brew "stow"
brew "switchaudio-osx"
brew "tmux"
brew "tree-sitter-cli"
brew "uv"
brew "wireguard-go"
brew "yazi"
brew "zsh"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "homebrew-zathura/zathura/zathura", args: ["with-synctex"]
brew "homebrew-zathura/zathura/zathura-djvu"
brew "homebrew-zathura/zathura/zathura-pdf-mupdf"
brew "homebrew-zathura/zathura/zathura-ps"
brew "morantron/tmux-fingers/tmux-fingers"
cask "nikitabobko/tap/aerospace"
cask "app-cleaner"
cask "bitwarden"
cask "brave-browser"
cask "discord"
cask "element"
cask "flameshot"
cask "font-ibm-plex-sans"
cask "font-ibm-plex-serif"
cask "font-iosevka"
cask "font-lato"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-twitter-color-emoji"
cask "ghostty"
cask "google-chrome"
cask "hammerspoon"
cask "inkscape"
cask "ipe"
cask "jellyfin-media-player"
cask "kitty"
cask "mactex-no-gui"
cask "microsoft-teams"
cask "omnissa-horizon-client"
cask "qbittorrent"
cask "raycast"
cask "sf-symbols"
cask "skim"
cask "slidepilot"
cask "syncthing-app"
cask "tidal"
cask "transmission"
cask "webex"
cask "wezterm"
cask "whatsapp"
cask "zotero"
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "RMS_sharing", id: 908570259
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
